<script setup>
import {ref} from 'vue'
import { mockDB } from '@/stores/index'

const isShow = ref(false)
</script>

<template>
  <div class="mx-auto w-full max-w-7xl">
    <h1 class="my-4 text-lg font-medium">
      Задание и его решение: (<a href="https://gitlab.com/sibkod/test" target="_blank" rel="noopener noreferrer">ссылка</a>)
    </h1>

    <div>
      <p>Дубликат задания</p>

      <p><b>Задача:</b> Ваша задача - создать простую таблицу с использованием Vue 3, которая будет отображать данные из JSON и обеспечивать сортировку по всем столбцам.</p>

      <p><b>Требования:</b> Используйте Vue 3 для создания компонента таблицы. Реализуйте таблицу, отображающую данные из JSON. Обеспечьте сортировку данных по столбцу статус. Добавьте функционал смены направления сортировки при повторном нажатии на заголовок столбца (по возрастанию/убыванию). Отобразите все столбцы из JSON данных в таблице.</p>

      <p><b>Условия:</b> У одного клиента может быть одна и более диет (Каждая диета должна быть отделена от другой горизонтальным разделителем.) в заказе и они могут иметь разное время окончания. Нужно учесть это при сортировке.</p>

      <p><b>Сортировка по статусу:</b>
      <ul>
        <li>Начинается через Х дней. (где чем больше х тем выше в списке)</li>
        <li>заканчивается сегодня</li>
        <li>заканчивается завтра</li>
        <li>заканчивается через Х дней (где чем больше х тем ниже в списке)</li>
        <li>закончилось Х дней назад (где чем больше х тем ниже в списке)</li>
      </ul>
      </p>

      <p><b>Доп задание:</b> Реализовать фильтр по столбцам. Например, отобразить заказы со статусом Начинается через Х дней</p>

      <p><b>PS:</b> Решение задачи предоставить любым удобным способом. Ссылка на репозиторий, архив, общий документ и т. д.</p>

    </div>

    <div class="flex flex-col items-start">
      <p><b>JSON данные:</b> (все совпадения с реальными личностями случайны!)</p>
      <button class="border py-2 px-3 rounded-md bg-gray-200 hover:bg-gray-400" @click="isShow = !isShow">Показать</button>
      <div v-if="isShow">{{ mockDB }}</div>
    </div>
  </div>
</template>

<style lang="scss">
p {
  margin: 8px 0;
}
</style>
